# -----------------------------------------------
#   Author: Liam Howell
#   Description: Brew & Cask dependency definitions
# -----------------------------------------------

tap 'buo/cask-upgrade'
tap 'ferdium/ferdium'
tap 'homebrew/aliases'
tap 'homebrew/bundle'
tap 'homebrew/services'

brew 'asdf'
brew 'git'
brew 'gnupg'
brew 'imagemagick'
brew 'mas'
brew 'p7zip'
brew 'sheldon'
brew 'starship'
brew 'tmux'
brew 'zsh'

cask 'beekeeper-studio'
cask 'brave-browser'
cask 'cyberduck'
cask 'docker'
cask 'ferdium'
cask 'figma'
cask 'firefox'
cask 'handbrake'
cask 'hyper'
cask 'imageoptim'
cask 'latest'
cask 'maccy'
cask 'mockoon'
cask 'notion'
cask 'postman'
cask 'raycast'
cask 'rectangle'
cask 'shottr'
cask 'stats'
cask 'the-unarchiver'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
