# ----------------------------------------
#   Author: Liam Howell
#   Description: Brew & Cask dependency definitions
# ----------------------------------------

tap 'ferdium/ferdium'
tap 'buo/cask-upgrade'
tap 'homebrew/aliases'
tap 'homebrew/bundle'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/services'
tap 'shivammathur/php'
tap 'wilmoore/formulae'

brew 'bash-completion'
brew 'composer'
brew 'gh'
brew 'git'
brew 'httpie'
brew 'imagemagick'
brew 'mas'
brew 'nvm'
brew 'p7zip'
brew 'php'
brew 'php-version'
brew 'pnpm'
brew 'yarn'

cask 'amazon-music'
cask 'docker'
cask 'ferdium-nightly'
cask 'figma'
cask 'firefox'
cask 'google-chrome'
cask 'hot'
cask 'hyper'
cask 'notion'
cask 'postman'
cask 'private-internet-access'
cask 'rectangle'
cask 'the-unarchiver'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
