# -----------------------------------------------
#   Author: Liam Howell
#   Description: Brew & Cask dependency definitions
# -----------------------------------------------

tap 'buo/cask-upgrade'
tap 'ferdium/ferdium'
tap 'homebrew/aliases'
tap 'homebrew/bundle'
tap 'homebrew/cask-fonts'
tap 'homebrew/cask-versions'
tap 'homebrew/cask'
tap 'homebrew/core'
tap 'homebrew/services'
tap 'shivammathur/php'
tap 'wilmoore/formulae'

brew 'composer'
brew 'fnm'
brew 'gh'
brew 'git'
brew 'httpie'
brew 'imagemagick'
brew 'mas'
brew 'p7zip'
brew 'php-version'
brew 'php'
brew 'pnpm'
brew 'sheldon'
brew 'starship'
brew 'yarn'
brew 'zsh'

cask 'beekeeper-studio'
cask 'brave-browser'
cask 'cyberduck'
cask 'docker'
cask 'ferdium-nightly'
cask 'figma'
cask 'firefox'
cask 'hyper'
cask 'maccy'
cask 'mockoon'
cask 'notion'
cask 'postman'
cask 'raycast'
cask 'rectangle'
cask 'shottr'
cask 'stats'
cask 'the-unarchiver'
cask 'transmission'
cask 'visual-studio-code'
cask 'vlc'
